---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInDesignOptionWarn
source: html/329be539-923b-1530-14c8-9e7db2c82734.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInDesignOptionWarn Property

A sweep in the main model cannot be hosted by an element in a Design Option [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingSweepByElementsInDesignOptionWarn { get; }
```